[{"id": "153e8788-a43b-4fec-a056-fb87e5813b4d", "name": "League of Legends", "description": "League of Legends is a fast-paced, competitive online game that blends the speed and intensity of an RTS with RPG elements. Two teams of powerful champions, each with a unique design and playstyle, battle head-to-head across various battlefields and game modes.", "price": 80.00, "manufacturer": {"id": "a5671dfd-55bd-492b-9215-9d96838197b0", "name": "Riot Games", "address": "123 Test System, Los Angeles, CA", "contact": "test@test.com"}, "categories": ["MULTIPLAYER", "STRATEGY", "ESPORTS"], "createdAt": "2023-01-10T21:49:04Z", "updatedAt": "2023-03-31T05:39:14Z", "reviews": [{"reviewerName": "Jan Kowalski", "comment": "Fantastic game with immense eSports potential. A superb mix of strategy and action, though the community can sometimes be demanding.", "rating": 9, "reviewDate": "2023-12-30T15:23:00Z"}, {"reviewerName": "Anna Nowak", "comment": "The game has incredible depth and variety, but the learning curve is quite steep for new players. I recommend new players to watch some tutorials first.", "rating": 7, "reviewDate": "2023-12-15T10:17:00Z"}, {"reviewerName": "Piotr Wiśniewski", "comment": "The game is good, but it requires a lot of time and dedication to fully understand and enjoy. It can be frustrating for people who don't have a lot of free time.", "rating": 6, "reviewDate": "2024-01-05T20:00:00Z"}]},
{"id": "0c9cec4f-fa48-4d86-9ef7-7e638c4f659d", "name": "Counter Strike 2", "description": "Counter Strike 2 is the next iteration of the classic first-person shooter game, offering advanced graphics, new maps, and enhanced gameplay mechanics. Teams of terrorists and counter-terrorists battle in various game modes to complete objectives like bomb planting/defusing and hostage rescue.", "price": 29.99, "manufacturer": {"id": "74043015-0a8e-453e-a6c9-b25b77cd86fd", "name": "Valve Corporation", "address": "123 Test Test, Bellevue, WA", "contact": "support@test.com"}, "categories": ["FIRST_PERSON_SHOOTER", "MULTIPLAYER", "ACTION"], "createdAt": "2024-01-01T00:00:00Z", "updatedAt": "2024-01-12T00:00:00Z", "reviews": [{"reviewerName": "Alex Johnson", "comment": "An excellent sequel to the classic. The new maps are fantastic, and the graphics overhaul is impressive. However, it still retains the core gameplay that made the original so popular.", "rating": 8, "reviewDate": "2024-01-10T12:00:00Z"}, {"reviewerName": "Emily Smith", "comment": "As a long-time fan, I'm slightly disappointed. The game feels a bit too similar to the original, and I was expecting more innovative features. It's still a solid game, but not groundbreaking.", "rating": 6, "reviewDate": "2024-01-11T15:30:00Z"}, {"reviewerName": "Michael Brown", "comment": "Fantastic gameplay and a great competitive scene. The new mechanics add a fresh twist to the game. However, the learning curve for new players can be steep.", "rating": 7, "reviewDate": "2024-01-09T18:45:00Z"}]}]
